# 开发人员：leo
# 开发时间：2022/7/19 12:57

# 赋值运算符
# 执行顺序：从右到左
# 支持链式赋值：a=b=c=20  # 3个变量都赋值20
# 支持系列解包赋值： a,b,c=20,30,40  # 要求=左侧和右侧个数相等，否则会报错

a = 3 + 4  # 执行顺序：从右到左
print(a, type(a))

a = b = c = 20  # 链式赋值，创建了一个整型对象20，a,b,c都指向这个对象，所以a,b,c内保存的地址都是一样的，都是保存对象20的地址
print(a, id(a))  # id(a)输出a指向对象的地址，下面同理，因为a,b,c都指向整型对象20，故它们输出的地址是一样的
print(b, id(b))
print(c, id(c))

a = 20
a += 30  # a = a + 30
print(a)
a -= 10  # a = a - 10
print(a)
a *= 2  # a = a * 2
print(a)
a /= 3
print(a)
a //= 2
print(a)

print("---解包赋值---")
a, b, c = 10, 20, 30  # 创建3个对象，分别赋值给a,b,c
print(a, b, c)
print(id(a), id(b), id(c))

print(
    '''
解包赋值的优点：交换变量的值时不需要中间变量
'''
)
a, b = 10, 20
print("交换之前：", a, b)
# 交换代码
a, b = b, a
print("交换之后：", a, b)
