# 开发人员：leo
# 开发时间：2022/9/23 22:47

# 本章小结

"""
数据结构        是否是可变序列（是否可增删改）        是否可重复       是否有序        定义符合
————————————————————————————————————————————————————————————————————————————————
列表list                   可变                   可重复          有序           []
元组tuple                 不可变                  可重复          有序           ()
字典dict                   可变                key不可重复        无序      {key:value}
                                            value可重复
集合set                    可变                不可重复          无序           {}

"""